/* Copyright (C) 2019 *****************************************************************************
									 杭州科强智能控制系统有限公司
====================================================================================================
项目名称：T6H5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 ========================================
文件名称：CanModule_Drv.c
文件说明：CAN模块驱动文件

作    者：LC
编写时间：2019.9
======================================== 修   改    历   史 ========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 ========================================



****************************************************************************************************/
#ifndef CanModule_Drv_h
	#define CanModule_Drv_h


#ifdef CanModule_Drv_c
	#define CanModule_Drv_ext
#else
	#define CanModule_Drv_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/


/*======================================== 全局有效变量定义 =======================================*/


/*======================================== 全局有效函数声明 =======================================*/
void CanModule_Drv_Init(void);	//CAN 模块初始化
void CanModule_Drv_Pcs(void);	//CAN 模块处理

Bool CanMolduleSendFinishChk(void);		//CAN模块待发送数据都是否已经发送完检查	20170705加

#endif
