/* Copyright (C) 2009 *******************************************************************************
									 杭州科强智能控制系统有限公司
=====================================================================================================
项目名称：T6F5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 ========================================
文件名称：DIDO.h
文件说明：T6F5硬件平台中数字IO信号驱动。

作    者：CXQ
编写时间：2009.11
======================================== 修   改    历   史 ========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 ========================================



****************************************************************************************************/
#ifndef DIDO_Drv_h
	#define DIDO_Drv_h


#ifdef DIDO_Drv_c
	#define DIDO_Drv_ext
#else
	#define DIDO_Drv_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/
//#define GetProdSnrTri()	(SB_ReadData(mSBA_ProdSnrTri)&mBit0)		//可能是软件处理实现，所以用函数实现
//#define RstProdSnrTri()	(SB_WriteData(mSBA_ProdSnrTri,0))			//可能是软件处理实现，所以用函数实现	


/*======================================== 全局有效变量定义 =======================================*/


/*======================================== 全局有效函数声明 =======================================*/
void DIDO_Drv_Init(void);		//DIDO驱动初始化	于主循环
void DIDO_Drv_Pcs(void);		//DIDO驱动处理		于主循环

void IODebugSetMode(U8 Mode);					//IO调试设置模式			Mode:0-退出 1-普通 2-高级(保留)
Bool IODebugSetOut(U8 IOType,U8 HardSN);		//IO调试设置通道
Bool HardSNIsHtrOut(U16 HardSN);				//硬件通道是加热输出检查

U8 GetCanModIODebugOut(U8 CanModSN);			//获取CAN模块IO调试通讯		主要由CanModule_Drv.c文件调用，用以获取强制输出的通道


Bool GetProdSnrTri(void);		//获取检物电眼状态	与CPLD电路相关,暂定DI19；也可能是软件处理实现，取决于Para_ProdSnrSoftTri参数
void RstProdSnrTri(void);		//复位检物电眼状态	与CPLD电路相关,暂定DI19；也可能是软件处理实现，取决于Para_ProdSnrSoftTri参数

void RstDbgModeTimer(void);		//复位调试模式计时器	DAC_Drv.c中调用
#endif
