/* Copyright (C) 2019 *****************************************************************************
									 杭州科强智能控制系统有限公司
====================================================================================================
项目名称：T6H5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 ========================================
文件名称：DigiLed_Drv.c
文件说明：数码管驱动

作    者：WLZ
编写时间：2025.4
======================================== 修   改    历   史 ========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 ========================================



****************************************************************************************************/
#ifndef DigiLed_Drv_h
	#define DigiLed_Drv_h


#ifdef DigiLed_Drv_c
	#define DigiLed_Drv_ext
#else
	#define DigiLed_Drv_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/
//秒点闪代表程序运行正常
//数字越大，显示优先级越高

//正常状态	(秒点闪、数字不闪)
#define	mDC_BootMode			8	//Boot模式但未在下载应用程序
#define mDC_BootModeLoadApp		7	//Boot模式且正在下载应用程序

#define mDC_SysStop				4	//紧急停止
#define mDC_AutoMode			3	//自动模式
#define	mDC_ManuModeAct			2	//手动模式且有动作进行中
#define	mDC_ManuModeFree		1	//手动模式且空闲

//异常状态	(秒点闪、数字快闪)
#define	mDC_AppErr				9+0x80	//应用程序无效			应用程序未下载或校验出错，在Boot模式给出
#define	mDC_HardErr				8+0x80	//硬件失效				主要是FRAM出错
#define	mDC_PlatLinkCodeErr		7+0x80	//硬件配置出错			硬件平台和硬件配置(HardConf)的互连代码不匹配
#define mDC_CommLinkErr			6+0x80	//通讯联机出错			与界面未建立通讯
#define mDC_CanErr				5+0x80	//CAN出错				与CAN模块通讯异常、与界面CAN通讯异常
#define mDC_PowerErr			4+0x80	//电源异常				IO电源、HADC电源或LADC电源异常
#define mDC_DIDOPwrProt			3+0x80	//IO电源保护
#define mDC_HADCModErr			2+0x80	//HADC模块异常
#define	mDC_					1+0x80	//暂保留
#define mDC_OtherErr			0+0x80	//其它异常

/*======================================== 全局有效变量定义 =======================================*/


/*======================================== 全局有效函数声明 =======================================*/
void DigiLed_Init(void);		//数码LED初始化
void DigiLed_Pcs(void);			//数码LED处理

void SetDigiLed(U8 DispCode);	//设置数码LED	
	
	

#endif
