/* Copyright (C) 2009 *******************************************************************************
									 杭州科强智能控制系统有限公司
=====================================================================================================
项目名称：T6F5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 =========================================
文件名称：xxxxxx
文件说明：xxxxxx

作    者：CXQ
编写时间：2009.11
======================================== 修   改    历   史 =========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 =========================================



****************************************************************************************************/
#ifndef ESSD_Drv_h
	#define ESSD_Drv_h


#ifdef ESSD_Drv_c
	#define ESSD_Drv_ext
#else
	#define ESSD_Drv_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/



/*======================================== 全局有效变量定义 =======================================*/



/*======================================== 全局有效函数声明 =======================================*/
void ESSD_Drv_Init(void);			//CAN 模块初始化
void ESSD_Drv_Pcs(void);			//CAN 模块处理
U16 ESSD_GetCurrSDRealPres(void);	//当前驱动器反馈压力
U16 ESSD_GetCurrSDRealFlow(void);	//当前驱动器反馈流量

#endif
