/* Copyright (C) 2019 *****************************************************************************
									 杭州科强智能控制系统有限公司
====================================================================================================
项目名称：T6H5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 ========================================
文件名称：HADC_Drv.h
文件说明：HADC驱动文件

作    者：LC
编写时间：2019.9
======================================== 修   改    历   史 ========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 ========================================



****************************************************************************************************/
#ifndef HADC_Drv_h
	#define HADC_Drv_h


#ifdef HADC_Drv_c
	#define HADC_Drv_ext
#else
	#define HADC_Drv_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/
#define mHADDataBit			16		//HAD数据位数	供电子尺处理函数ADC值到位置转换时使用
#define mHADVolRange		10000	//HAD电压量程

/*======================================== 全局有效变量定义 =======================================*/


/*======================================== 全局有效函数声明 =======================================*/
void HADC_Drv_Init(void);	//HADC初始化
void HADC_Drv_Pcs(void);	//HADC处理					于主循环

Bool HADC_PriReq(U16 ResSn);//HADC的ADC转换优先级申请
	#define mHADCPR_DefSeq		0	//恢复默认序列
	
Bool HADC_PwrChk(void);		//HADC电源检查				True--正常
Bool HADC_ModuleChk(void);	//HADC模块检查				True--正常

#endif
