/* Copyright (C) 2009 *******************************************************************************
									 杭州科强智能控制系统有限公司
=====================================================================================================
项目名称：T6F5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 ========================================
文件名称：HardPlat_Drv.h
文件说明：T6F5硬件平台驱动，主要是识别硬件平台型号、定义硬件配置。

作    者：CXQ
编写时间：2009.11
======================================== 修   改    历   史 ========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 ========================================



****************************************************************************************************/
#ifndef HardPlat_Drv_h
	#define HardPlat_Drv_h

#ifdef HardPlat_Drv_c
	#define HardPlat_Drv_ext
#else
	#define HardPlat_Drv_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/



/*======================================== 全局有效变量定义 =======================================*/



/*======================================== 全局有效函数声明 =======================================*/
void HardPlat_Drv_Init(void);		//硬件平台初始化
void HardPlat_Drv_Pcs(void);		//硬件平台处理		置于主循环
U8 GetHardPlatLinkCode(void);   //获取硬件平台互连代码

#endif

