/* Copyright (C) 2019 *****************************************************************************
									 杭州科强智能控制系统有限公司
====================================================================================================
项目名称：T6H5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 =========================================
文件名称：xxxxxx
文件说明：xxxxxx

作    者：CXQ
编写时间：2009.11
======================================== 修   改    历   史 =========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 =========================================



****************************************************************************************************/
#ifndef HCIS300SD_Drv_h
	#define HCIS300SD_Drv_h


#ifdef HCIS300SD_Drv_c
	#define HCIS300SD_Drv_ext
#else
	#define HCIS300SD_Drv_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/
enum eSDSN{eSDSN_1,eSDSN_2,eSDSN_3,eSDSN_4,eSDSN_5,eSDSN_All};

#define mSDAR_Nor				0			//动作响应		常规
#define mSDAR_Eje				1			//动作响应		顶针专用
#define mSDAR_Mold				2			//动作响应		开合模专用
#define mSDAR_InjSlow			3			//动作响应		注射专用	平稳
#define mSDAR_InjMed			4			//动作响应		注射专用	均衡
#define mSDAR_InjFast			5			//动作响应		注射专用	快速

#define mSDAR_InjActRespLevel	0x00000080	//动作响应		根据Para_SDInjActRespLevel

#define	mSDAR_Mask				0x000000ff	//HCIS300SD响应的掩码				2012-2-24
											//最低字节用于HCIS300SD的响应设置
											//最高二字节用于J5卡多段PID的设置

/*======================================== 全局有效变量定义 =======================================*/



/*======================================== 全局有效函数声明 =======================================*/
void HCIS300SD_Drv_Init(void);	//CAN 模块初始化
void HCIS300SD_Drv_Pcs(void);	//CAN 模块处理

void SetActResp(enum eSDSN SDSN,U32 ActRespLevel);


#endif
