/* Copyright (C) 2009 *******************************************************************************
									 杭州科强智能控制系统有限公司
=====================================================================================================
项目名称：T6F5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 =========================================
文件名称：xxxxxx
文件说明：xxxxxx

作    者：LC
编写时间：2025.3
======================================== 修   改    历   史 =========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 =========================================



****************************************************************************************************/
#ifndef HiLectroM6_Drv_h
	#define HiLectroM6_Drv_h


#ifdef HiLectroM6_Drv_c
	#define HiLectroM6_Drv_ext
#else
	#define HiLectroM6_Drv_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/



/*======================================== 全局有效变量定义 =======================================*/



/*======================================== 全局有效函数声明 =======================================*/
void HiM6_Drv_Init(void);			//CAN 模块初始化
void HiM6_Drv_Pcs(void);			//CAN 模块处理
U16 HiM6_GetCurrRealPres1(void);
U16 HiM6_GetCurrRealPres2(void);
S32 HiM6_GetCurrScrewPos(void);

#endif
