/* Copyright (C) 2019 *****************************************************************************
									 杭州科强智能控制系统有限公司
====================================================================================================
项目名称：T6H5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 ========================================
文件名称：IIC_Drv.c
文件说明：IIC驱动程序

作    者：WLZ
编写时间：2025.3
======================================== 修   改    历   史 ========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 ========================================



****************************************************************************************************/
#ifndef IIC_Drv_h
	#define IIC_Drv_h


#ifdef IIC_Drv_c
	#define IIC_Drv_ext
#else
	#define IIC_Drv_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/


/*======================================== 全局有效变量定义 =======================================*/


/*======================================== 全局有效函数声明 =======================================*/
void I2Cx_Drv_Init(void);					//I2C初始化
Bool I2CRead(U8 Slave,U16 Address,U16 Datalen,U8 *ReadBuffer,Bool Addr16Flag);		//I2C读取
Bool I2CWrite(U8 Slave,U16 Address,U16 Datalen,U8 *WriteBuffer,Bool Addr16Flag);	//I2C写入

//T6F5  FM24CL64	Slave:0x00  Addr:0x0000-0x1fff

#endif
