/* Copyright (C) 2009 *******************************************************************************
									 杭州科强智能控制系统有限公司
=====================================================================================================
项目名称：T6F5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 ========================================
文件名称：xxxxxx
文件说明：xxxxxx

作    者：CXQ
编写时间：2009.11
======================================== 修   改    历   史 ========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 ========================================



****************************************************************************************************/
#ifndef J5_PID_Drv_h
	#define J5_PID_Drv_h

#ifdef J5_PID_Drv_c
	#define J5_PID_Drv_ext
#else
	#define J5_PID_Drv_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/
enum eJ5SN{eJ5SN_1,eJ5SN_2,eJ5SN_3,eJ5SN_4,eJ5SN_All};

#define	mJ5PID_Mask			0xffff0000	//J5_PID的掩码
#define	mJ5PID_Offset		16			//J5_PID的偏移字节
										//最低字节用于HCIS300SD的响应设置
										//最高二字节用于J5卡多段PID的设置		4位对应一个驱动器，共支持4个驱动器
										//									如果使用4个驱动器，只需改变动作中ActResp配置

#define mJ5PID_Nor			(0<<mJ5PID_Offset)	//J5_PID		常规
#define mJ5PID_Mold			(1<<mJ5PID_Offset)	//J5_PID		开合模（不含高压锁模）
#define mJ5PID_Eject		(2<<mJ5PID_Offset)	//J5_PID		顶针
#define mJ5PID_Inject		(3<<mJ5PID_Offset)	//J5_PID		注射
#define mJ5PID_HoldPres		(4<<mJ5PID_Offset)	//J5_PID		保压
#define mJ5PID_SuckBack		(5<<mJ5PID_Offset)	//J5_PID		射退
#define mJ5PID_MoldCls_HP	(6<<mJ5PID_Offset)	//J5_PID		高压锁模

/*======================================== 全局有效变量定义 =======================================*/

/*======================================== 全局有效函数声明 =======================================*/
void J5_PID_Drv_Init(void);			//J5_PID初始化
void J5_PID_Drv_Pcs(void);			//J5_PID处理		于主循环

void Set_J5_PID(U32 PID_Level);		//设置J5的PID

#endif
