/* Copyright (C) 2009 *******************************************************************************
									 杭州科强智能控制系统有限公司
=====================================================================================================
项目名称：T6F5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 =========================================
文件名称：KWhMeter_Drv.h
文件说明：电表驱动，包括脉冲式、RS485通过CAN转接（DTL645-97版）、CAN、RS485等接口类型，暂主要是RS485通
          过CAN转接（DTL645-97版）的，特点是按照DTL645-97版协议、通过CAN-RS485模块转接，该模块采用周立
          功（沈阳广成）的CAN485MB，特点是模块内有协议，只向RS485总线转发帧数据域的内容。

作    者：CXQ
编写时间：
======================================== 修   改    历   史 =========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 =========================================



****************************************************************************************************/
#ifndef KWhMeter_Drv_h
	#define KWhMeter_Drv_h

#ifdef KWhMeter_Drv_c
	#define KWhMeter_Drv_ext
#else
	#define KWhMeter_Drv_ext extern
#endif

/*========================================= 全局有效宏定义 ========================================*/

	
/*======================================== 全局有效变量定义 =======================================*/


/*======================================== 全局有效函数声明 =======================================*/
void KWhMeter_Drv_Init(void);		//电表测量初始化
void KWhMeter_Drv_Pcs(void);		//电表测量处理

#endif

