/* Copyright (C) 2019 *****************************************************************************
									 杭州科强智能控制系统有限公司
====================================================================================================
项目名称：T6H5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 ========================================
文件名称：LADC_Drv.h
文件说明：温度测量文件

作    者：LC
编写时间：2019.9
======================================== 修   改    历   史 ========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 ========================================



****************************************************************************************************/
#ifndef LADC_Drv_h
	#define LADC_Drv_h

#ifdef LADC_Drv_c
	#define LADC_Drv_ext
#else
	#define LADC_Drv_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/
#define mLADC_PwrOff_001C		777777	//断电		单位0.001c
#define mLADC_TherBrk_001C		888888	//断偶		单位0.001c
#define mLADC_OverRange_001C	999999//超量程		单位0.001c


/*======================================== 全局有效变量定义 =======================================*/

/*======================================== 全局有效函数声明 =======================================*/
void LADC_Drv_Init(void);			//LADC驱动初始化
void LADC_Drv_Pcs(void);			//LADC处理			于主循环

Bool LADC_PwrChk(void);				//LADC电源检查

#endif

