/* Copyright (C) 2009 *******************************************************************************
									 杭州科强智能控制系统有限公司
=====================================================================================================
项目名称：T6F5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 =========================================
文件名称：License.h
文件说明：功能授权处理。

作    者：CXQ
编写时间：2011.10
======================================== 修   改    历   史 =========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 =========================================



****************************************************************************************************/
#ifndef License_Drv_h
	#define License_Drv_h

#ifdef License_Drv_c
	#define License_Drv_ext
#else
	#define License_Drv_ext extern
#endif

/*========================================= 全局有效宏定义 ========================================*/
#define mLic_Level_Basic	0	//基本授权…………全自动正常工作，否则禁止全自动
#define mLic_Level_ENet		1	//网络功能授权……网络管理功能，否则只提供简单的DEMO版网络功能
#define mLic_Level_2		2	//
#define mLic_Level_3		3	//
#define mLic_Level_4		4	//
#define mLic_Level_5		5	//
#define mLic_Level_6		6	//
#define mLic_Level_7		7	//
	
/*======================================== 全局有效变量定义 =======================================*/


/*======================================== 全局有效函数声明 =======================================*/
Bool License_Chk(U32 PartSN,U32 License,U32 Level);		//License检查

#endif

