/* Copyright (C) 2019 *****************************************************************************
									 杭州科强智能控制系统有限公司
====================================================================================================
项目名称：T6H5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 ========================================
文件名称：MADC_Drv.h
文件说明：中速ADC驱动。

作    者：BSH
编写时间：2019.9
======================================== 修   改    历   史 ========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 ========================================



****************************************************************************************************/
#ifndef MADC_Drv_h
	#define MADC_Drv_h


#ifdef MADC_Drv_c
	#define MADC_Drv_ext
#else
	#define MADC_Drv_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/
#define mMADC_DataBit		16		//HAD数据位数		供电子尺处理函数ADC值到位置转换时使用
#define mMADC_DataMax		0xffff	//HAD数据最大值
#define mMADC_VolRange		10000	//HAD电压量程		10.000V

/*======================================== 全局有效变量定义 =======================================*/

/*======================================== 全局有效函数声明 =======================================*/
void MADC_Drv_Init(void);	
void MADC_Drv_Pcs(void);
	

#endif
