/* Copyright (C) 2018 *****************************************************************************
									 杭州科强智能控制系统有限公司
====================================================================================================
项目名称：TopMxx型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 ========================================
文件名称：定时器驱动.c
文件说明：

作    者：WLZ
编写时间：2018.01
======================================== 修   改    历   史 ========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 ========================================
##系统资源
1、STM32H743 TIM2\TIM5及其匹配寄存器。（GD32原工程为TIMER1\TIMER4）
2、TIM2中断

##其它说明
1、本文件中驱动比较特殊，独立性较差，定时比较中断与其它驱动可能存在配合关系。
2、本文件中函数是本项目的基础，并且与其它模块存在密切配合关系，涉及定时周期等的程序修改务请谨慎。
3、定时器的定时单位10us，最大12.7h，各时间计算均以其为参考。
4、由于主循环周期不固定，为保证动作中延迟等的时间精度，不采用给出定时中断标志并以其为计时基础的方式，而采用
   保存系统时间（CNT），然后通过计算某时刻与系统时间差值的方式，来得到准确的经过时间。
5、本文件预留TIM2匹配中断（当前未启用）。
6、本文件还定义计时器及其操作方法函数，需要注意使用时操作顺序。

****************************************************************************************************/
//#define mSysDebug				

#ifndef Time_Drv_c
	#define Time_Drv_c
#endif

#include "Include.h"
/*======================================== 模块内有效宏定义 =======================================*/


/*======================================= 模块内有效变量定义 ======================================*/


/*======================================= 模块内有效函数声明 ======================================*/


/****************************************************************************************************
函数名称：int main(void)
函数说明：主函数
输入参数：
返 回 值：
其    它：为方便本文件中函数调试而设
****************************************************************************************************/
#ifdef mSysDebug


int main(void)
{   
	do
	{
	}while(mTrue);
}
#endif	//mSysDebug


/****************************************************************************************************
函数名称：Time驱动初始化
函数说明：TIM2及其中断相关初始化
输入参数：
返 回 值：
其    它：
1)TIM2以10us为单位计时，计时不复位，即计时在0～0xffffffff循环
2)TIMPRE=×4，PCLK1=50MHz→定时器内核时钟200MHz。TIM2 PSC=2000→100kHz(10us)，TIM5 PSC=2→100MHz(10ns)。
****************************************************************************************************/
void Time_Drv_Init(void)
{
	//TIM2初始化，10us定时器（GD32原工程为TIMER1）
	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM2);
    LL_RCC_SetTIMPrescaler(LL_RCC_TIM_PRESCALER_FOUR_TIMES);
    LL_TIM_DeInit(TIM2);
    
    LL_TIM_SetPrescaler(TIM2, 2000U - 1U);
    LL_TIM_SetCounterMode(TIM2, LL_TIM_COUNTERMODE_UP);
    LL_TIM_SetAutoReload(TIM2, 0xFFFFFFFFUL);
    LL_TIM_SetClockDivision(TIM2, LL_TIM_CLOCKDIVISION_DIV1);
    LL_TIM_GenerateEvent_UPDATE(TIM2);
    /* TIM2使能 */
    LL_TIM_EnableCounter(TIM2);
  	
	//TIM5初始化，10ns定时器
	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM5);
    LL_RCC_SetTIMPrescaler(LL_RCC_TIM_PRESCALER_FOUR_TIMES);
    LL_TIM_DeInit(TIM5);
    
    LL_TIM_SetPrescaler(TIM5, 2U - 1U);
    LL_TIM_SetCounterMode(TIM5, LL_TIM_COUNTERMODE_UP);
    LL_TIM_SetAutoReload(TIM5, 0xFFFFFFFFUL);
    LL_TIM_SetClockDivision(TIM5, LL_TIM_CLOCKDIVISION_DIV1);
    LL_TIM_GenerateEvent_UPDATE(TIM5);
    
    /* 自动重装载影子寄存器使能 */
    LL_TIM_EnableARRPreload(TIM5);
    /* TIM5使能 */
    LL_TIM_EnableCounter(TIM5);
}
/****************************************************************************************************
函数名称：TIM2相关中断
函数说明：
输入参数：
返 回 值：
其    它：
1)调试过程中，如果断点设在本中断函数中，会出现计时中断失效的情况，这是由于TIM2在程序中断时计数不停所致。
2)当前中断未启用，为预留功能。
****************************************************************************************************/
void TIM2_IRQHandler(void)
{
    // 检查通道1匹配中断标志
    if((SET == LL_TIM_IsActiveFlag_CC1(TIM2)) && (SET == LL_TIM_IsEnabledIT_CC1(TIM2)))
    {
        TIM2->CCR1 = TIM2->CCR1 + 100000U;
        LL_TIM_ClearFlag_CC1(TIM2);
    }

    // 错误处理：检查定时器错误标志
    if(SET == LL_TIM_IsActiveFlag_CC1OVR(TIM2)) {
        LL_TIM_ClearFlag_CC1OVR(TIM2);
    }
}
/****************************************************************************************************
函数名称：普通10ns计时器复位
函数说明：复位普通10ns计时器
输入参数：Timer--计时器
返 回 值：
其    它：
****************************************************************************************************/
void G10nsTimerRes(G10nsTimer *Timer)
{
	Timer->StartTime=Get10nSTime();
}
/****************************************************************************************************
函数名称：普通10ns计时器时间计算函数
函数说明：计算经过的时间，单位10ns
输入参数：Timer--计时器
返 回 值：以10ns为单位的时间
其    它：
****************************************************************************************************/
U32 G10nsTimerCal(G10nsTimer *Timer)
{
	return (Get10nSTime()-Timer->StartTime);		//系统时间单位是10ns
}
/****************************************************************************************************
函数名称：普通10ns计时器时间超过比较函数
函数说明：比较是否已经超过期望时间，单位10ns
输入参数：Timer--计时器；CmpTime--期望时间
返 回 值：mTrue--时间已经超过；mFalse--时间未到
其    它：
****************************************************************************************************/
Bool G10nsTimerOver(G10nsTimer *Timer,U32 CmpTime)
{
	return ((Get10nSTime()-Timer->StartTime)>CmpTime?mTrue:mFalse);	
}
/****************************************************************************************************
函数名称：普通10us计时器时间未到比较函数
函数说明：比较是否未到期望时间，单位10us
输入参数：Timer--计时器；CmpTime--期望时间
返 回 值：mTrue--时间已经超过；mFalse--时间未到
其    它：
****************************************************************************************************/
Bool G10nsTimerLess(G10nsTimer *Timer,U32 CmpTime)
{
	return ((Get10nSTime()-Timer->StartTime)<CmpTime?mTrue:mFalse);	
}
/****************************************************************************************************
函数名称：延时n*1us
函数说明：
输入参数：DlyTi--延时时间，单位1us
返 回 值：无
其    它：
****************************************************************************************************/
void Dly1us(U32 DlyTi)
{
	G10nsTimer t;
	DlyTi=DlyTi*100;
	G10nsTimerRes(&t);
	while(G10nsTimerLess(&t,DlyTi)){;}
}
/****************************************************************************************************
函数名称：获取当前时间
函数说明：
输入参数：
返 回 值：
其    它：
****************************************************************************************************/
void GetCurrentTime(G10nsTimer *Timer)
{
	Timer->StartTime=Get10nSTime();
}
/****************************************************************************************************
函数名称：普通10us计时器复位
函数说明：复位普通10us计时器
输入参数：Timer--计时器
返 回 值：
其    它：
****************************************************************************************************/
void G10usTimerRes(G10usTimer *Timer)
{
	Timer->StartTime=GetSysTime();
}
/****************************************************************************************************
函数名称：普通10us计时器时间计算函数
函数说明：计算经过的时间，单位10us
输入参数：Timer--计时器
返 回 值：以10us为单位的时间
其    它：
****************************************************************************************************/
U32 G10usTimerCal(G10usTimer *Timer)
{
	return (GetSysTime()-Timer->StartTime);		//系统时间单位是10us
}
/****************************************************************************************************
函数名称：普通10us计时器时间超过比较函数
函数说明：比较是否已经超过期望时间，单位10us
输入参数：Timer--计时器；CmpTime--期望时间
返 回 值：mTrue--时间已经超过；mFalse--时间未到
其    它：
****************************************************************************************************/
Bool G10usTimerOver(G10usTimer *Timer,U32 CmpTime)
{
	return ((GetSysTime()-Timer->StartTime)>CmpTime?mTrue:mFalse);	
}
/****************************************************************************************************
函数名称：普通10us计时器时间未到比较函数
函数说明：比较是否未到期望时间，单位10us
输入参数：Timer--计时器；CmpTime--期望时间
返 回 值：mTrue--时间未到；mFalse--时间已经超过
其    它：
****************************************************************************************************/
Bool G10usTimerLess(G10usTimer *Timer,U32 CmpTime)
{
	return ((GetSysTime()-Timer->StartTime)<CmpTime?mTrue:mFalse);	
}
/****************************************************************************************************
函数名称：普通10ms计时器复位
函数说明：复位普通10ms计时器
输入参数：Timer--计时器
返 回 值：
其    它：
****************************************************************************************************/
void G10msTimerRes(G10msTimer *Timer)
{
	Timer->StartTime=GetSysTime();
}
/****************************************************************************************************
函数名称：普通100ms计时器复位
函数说明：复位普通100ms计时器
输入参数：Timer--计时器
返 回 值：
其    它：
****************************************************************************************************/
void G100msTimerRes(G100msTimer *Timer)
{
	Timer->StartTime=GetSysTime();
}
/****************************************************************************************************
函数名称：普通10ms计时器时间计算函数
函数说明：计算经过的时间，单位10ms
输入参数：Timer--计时器
返 回 值：以10ms为单位的时间
其    它：
****************************************************************************************************/
U32 G10msTimerCal(G10msTimer *Timer)
{
	return (GetSysTime()-Timer->StartTime)/1000;		//系统时间单位是10us
}
/****************************************************************************************************
函数名称：普通100ms计时器时间计算函数
函数说明：计算经过的时间，单位100ms
输入参数：Timer--计时器
返 回 值：以100ms为单位的时间
其    它：
****************************************************************************************************/
U32 G100msTimerCal(G100msTimer *Timer)
{
	return (GetSysTime()-Timer->StartTime)/10000;	//系统时间单位是10us
}
/****************************************************************************************************
函数名称：普通10ms计时器时间超过比较函数
函数说明：比较是否已经超过期望时间，单位10ms
输入参数：Timer--计时器；CmpTime--期望时间
返 回 值：mTrue--时间已经超过；mFalse--时间未到
其    它：
****************************************************************************************************/
Bool G10msTimerOver(G10msTimer *Timer,U32 CmpTime)
{
	return (GetSysTime()-Timer->StartTime)>(CmpTime*1000)?mTrue:mFalse;	
}
/****************************************************************************************************
函数名称：普通100ms计时器时间超过比较函数
函数说明：比较是否已经超过期望时间，单位100ms
输入参数：Timer--计时器；CmpTime--期望时间
返 回 值：mTrue--时间已经超过；mFalse--时间未到
其    它：
****************************************************************************************************/
Bool G100msTimerOver(G100msTimer *Timer,U32 CmpTime)
{
	return (GetSysTime()-Timer->StartTime)>(CmpTime*10000)?mTrue:mFalse;	
}
/****************************************************************************************************
函数名称：普通10ms计时器时间未到比较函数
函数说明：比较是否未到期望时间，单位10ms
输入参数：Timer--计时器；CmpTime--期望时间
返 回 值：mTrue--时间已经超过；mFalse--时间未到
其    它：
****************************************************************************************************/
Bool G10msTimerLess(G10msTimer *Timer,U32 CmpTime)
{
	return (GetSysTime()-Timer->StartTime)<(CmpTime*1000)?mTrue:mFalse;	
}
/****************************************************************************************************
函数名称：普通100ms计时器时间未到比较函数
函数说明：比较是否未到期望时间，单位100ms
输入参数：Timer--计时器；CmpTime--期望时间
返 回 值：mTrue--时间已经超过；mFalse--时间未到
其    它：
****************************************************************************************************/
Bool G100msTimerLess(G100msTimer *Timer,U32 CmpTime)
{
	return (GetSysTime()-Timer->StartTime)<(CmpTime*10000)?mTrue:mFalse;	
}


/****************************************************************************************************
函数名称：超级10ms计时器复位
函数说明：复位超级10ms计时器
输入参数：Timer--计时器
返 回 值：
其    它：
****************************************************************************************************/
void S10msTimerRes(S10msTimer *Timer)
{
	Timer->StartTime=GetSysTime();
	Timer->TotalTime=0;
	
	Timer->PauseFlag=mFalse;
}
/****************************************************************************************************
函数名称：超级100ms计时器复位
函数说明：复位超级100ms计时器
输入参数：Timer--计时器
返 回 值：
其    它：
****************************************************************************************************/
void S100msTimerRes(S100msTimer *Timer)
{
	Timer->StartTime=GetSysTime();
	Timer->TotalTime=0;

	Timer->PauseFlag=mFalse;
}
/****************************************************************************************************
函数名称：超级10ms计时器计时暂停
函数说明：暂停计时
输入参数：Timer--计时器
返 回 值：
其    它：
****************************************************************************************************/
void S10msTimerPause(S10msTimer *Timer)
{
	Timer->TotalTime+=GetSysTime()-Timer->StartTime;
	Timer->PauseFlag=mTrue;
}
/****************************************************************************************************
函数名称：超级100ms计时器计时暂停
函数说明：暂停计时
输入参数：Timer--计时器
返 回 值：
其    它：
****************************************************************************************************/
void S100msTimerPause(S100msTimer *Timer)
{
	Timer->TotalTime+=GetSysTime()-Timer->StartTime;
	Timer->PauseFlag=mTrue;
}
/****************************************************************************************************
函数名称：超级10ms计时器计时继续
函数说明：继续计时
输入参数：Timer--计时器
返 回 值：
其    它：
****************************************************************************************************/
void S10msTimerResume(S10msTimer *Timer)
{
	Timer->StartTime=GetSysTime();
	Timer->PauseFlag=mFalse;	
}
/****************************************************************************************************
函数名称：超级100ms计时器计时继续
函数说明：继续计时
输入参数：Timer--计时器
返 回 值：
其    它：
****************************************************************************************************/
void S100msTimerResume(S100msTimer *Timer)
{
	Timer->StartTime=GetSysTime();
	Timer->PauseFlag=mFalse;	
}
/****************************************************************************************************
函数名称：超级10ms计时器时间计算函数
函数说明：计算经过的时间，单位10ms
输入参数：Timer--计时器
返 回 值：以10ms为单位的时间
其    它：
****************************************************************************************************/
U32 S10msTimerCal(S10msTimer *Timer)
{
	if(Timer->PauseFlag)
		return Timer->TotalTime/1000;	//暂停状态
	else
		return (GetSysTime()-Timer->StartTime+Timer->TotalTime)/1000;		//系统时间单位是10us
	
}
/****************************************************************************************************
函数名称：超级100ms计时器时间计算函数
函数说明：计算经过的时间，单位100ms
输入参数：Timer--计时器
返 回 值：以100ms为单位的时间
其    它：
****************************************************************************************************/
U32 S100msTimerCal(S100msTimer *Timer)
{
	if(Timer->PauseFlag)
		return Timer->TotalTime/10000;	//暂停状态
	else
		return (GetSysTime()-Timer->StartTime+Timer->TotalTime)/10000;		//系统时间单位是10us
}
/****************************************************************************************************
函数名称：超级10ms计时器时间超过比较函数
函数说明：比较是否已经超过期望时间，单位10ms
输入参数：Timer--计时器；CmpTime--期望时间
返 回 值：mTrue--时间已经超过；mFalse--时间未到
其    它：
****************************************************************************************************/
Bool S10msTimerOver(S10msTimer *Timer,U32 CmpTime)
{
	if(Timer->PauseFlag)
		return (Timer->TotalTime)>(CmpTime*1000)?mTrue:mFalse;	//暂停状态
	else
		return (GetSysTime()-Timer->StartTime+Timer->TotalTime)>(CmpTime*1000)?mTrue:mFalse;	
}
/****************************************************************************************************
函数名称：超级100ms计时器时间超过比较函数
函数说明：比较是否已经超过期望时间，单位100ms
输入参数：Timer--计时器；CmpTime--期望时间
返 回 值：mTrue--时间已经超过；mFalse--时间未到
其    它：
****************************************************************************************************/
Bool S100msTimerOver(S100msTimer *Timer,U32 CmpTime)
{
	if(Timer->PauseFlag)
		return (Timer->TotalTime)>(CmpTime*10000)?mTrue:mFalse;	//暂停状态
	else
		return (GetSysTime()-Timer->StartTime+Timer->TotalTime)>(CmpTime*10000)?mTrue:mFalse;	
}
/****************************************************************************************************
函数名称：超级10ms计时器时间未到比较函数
函数说明：比较是否未到期望时间，单位10ms
输入参数：Timer--计时器；CmpTime--期望时间
返 回 值：mTrue--时间已经超过；mFalse--时间未到
其    它：
****************************************************************************************************/
Bool S10msTimerLess(S10msTimer *Timer,U32 CmpTime)
{
	if(Timer->PauseFlag)
		return (Timer->TotalTime)<(CmpTime*1000)?mTrue:mFalse;	//暂停状态
	else
		return (GetSysTime()-Timer->StartTime+Timer->TotalTime)<(CmpTime*1000)?mTrue:mFalse;	
}
/****************************************************************************************************
函数名称：超级100ms计时器时间未到比较函数
函数说明：比较是否未到期望时间，单位100ms
输入参数：Timer--计时器；CmpTime--期望时间
返 回 值：mTrue--时间已经超过；mFalse--时间未到
其    它：
****************************************************************************************************/
Bool S100msTimerLess(S100msTimer *Timer,U32 CmpTime)
{
	if(Timer->PauseFlag)
		return (Timer->TotalTime)<(CmpTime*10000)?mTrue:mFalse;	//暂停状态
	else
		return (GetSysTime()-Timer->StartTime+Timer->TotalTime)<(CmpTime*10000)?mTrue:mFalse;	
}
/****************************************************************************************************
函数名称：延时n*1ms
函数说明：
输入参数：DlyTi--延时时间，单位1ms
返 回 值：无
其    它：
****************************************************************************************************/
void Dly1ms(U32 DlyTi)
{
	G10usTimer t;
	DlyTi=T1msTo10us(DlyTi);
	G10usTimerRes(&t);
	while(G10usTimerLess(&t,DlyTi)){;}
}
/****************************************************************************************************
函数名称：延时n*10us
函数说明：
输入参数：DlyTi--延时时间，单位10us
返 回 值：无
其    它：
****************************************************************************************************/
void Dly10us(U32 DlyTi)
{
	G10usTimer t;

	G10usTimerRes(&t);
	while(G10usTimerLess(&t,DlyTi)){;}
}
/****************************************************************************************************
函数名称：运行时间测量
函数说明：测量两个点之间程序执行时间，单位10us
输入参数：MeasStartFlag		mTrue-测量点开始	mFalse-测量点结束
返 回 值：运行时间
其    它：
****************************************************************************************************/
U32 RunTimeMeas_10us(Bool MeasStartFlag)
{
	static U32 RunTime_10us;
	
	if(MeasStartFlag)
	{	//设置测量开始点
		RunTime_10us=GetSysTime();
		return 0xffffffff;
	}
	else
	{	//测量结束点
		return GetSysTime()-RunTime_10us;
	}
}
/****************************************************************************************************
函数名称：时钟输出配置
函数说明：
输入参数：
返 回 值：
其    它：
****************************************************************************************************/
void clock_output_config(void)
{
    /* STM32H743移植：PA8 MCO时钟输出不再使用（原GD32工程用于模拟总线时钟） */
}



