/* Copyright (C) 2019 *****************************************************************************
									 杭州科强智能控制系统有限公司
====================================================================================================
项目名称：T6H5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 =========================================
文件名称：WDT_Drv.h
文件说明：看门狗驱动

作    者：LC
编写时间：2019.9
======================================== 修   改    历   史 =========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 =========================================



****************************************************************************************************/
#ifndef WDT_Drv_h
	#define WDT_Drv_h

#ifdef WDT_Drv_c
	#define WDT_Drv_ext
#else
	#define WDT_Drv_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/
#ifdef mProgDebug			//程序调试			WDT不开启
	#define	EnWDT()		
	#define FeedWDT()		
#else
	#define	EnWDT()		WDT_Drv_Init()	//初始化WDT,10ms
	#define FeedWDT()	WDT_Drv_Feed()		//复位WDT
#endif									

/*======================================== 全局有效变量定义 =======================================*/


/*======================================== 全局有效函数声明 =======================================*/
void WDT_Drv_Init(void);		//看门狗初始化
void WDT_Drv_Feed(void);						//看门狗复位

#endif

