/* Copyright (C) 2009 *******************************************************************************
									 杭州科强智能控制系统有限公司
=====================================================================================================
项目名称：T6F5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 =========================================
文件名称：xxxxxx
文件说明：xxxxxx

作    者：CXQ
编写时间：2009.11
======================================== 修   改    历   史 =========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 =========================================
动作文件命名  ：动作名称_特点					特点如二板机、双色机等；或针对某厂家特殊机型。
												如未标示，则默认HT、常规三板机。
动作函数命名  ：Act_动作名称_模式_特点_序号		模式指手动(MM)、调模(AM)、自动(AU)、多种(MU或无)
												特点如某机型、某厂家的特有机型等
												序号用A、B、C……
动作函数ID命名：mASID_函数名_段名				

****************************************************************************************************/
#ifndef AL_BMC_h
	#define AL_BMC_h

#ifdef AL_BMC_c
	#define AL_BMC_ext
#else
	#define AL_BMC_ext extern
#endif


//动作组、细分、函数ID-----------------------------------------------------------------------------//
//在ActConf.h统一定义
//段ID定义(必须按序定义、要用于大小比较)-----------------------------------------------------------//
//动作函数-----------------------------------------------------------------------------------------//
void AL_BMCFeedIn(void *FP,FActAttrStr *FAAP);		//BMC加料进		手动按钮执行
	#define mASID_AL_BMCFeedIn_FI	10					//加料进

void AL_BMCFeedOut(void *FP,FActAttrStr *FAAP);		//BMC加料退		手动按钮执行
	#define mASID_AL_BMCFeedOut_FO	10					//加料退

void AL_BMCFeedInLink(void *FP,FActAttrStr *FAAP);	//BMC加料进		连动
	#define mASID_AL_BMCFeedInLink_FI	10				//加料进

void BMC_Pcs(void);									//BMC处理				主循环调用
void BMC_Charge(void *FP,FActAttrStr *FAAP);		//BMC处理(储料动作时)	由AU_Charge()中调用

#endif

