/* Copyright (C) 2009 *******************************************************************************
									 杭州科强智能控制系统有限公司
=====================================================================================================
项目名称：T6F5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 =========================================
文件名称：xxxxxx
文件说明：xxxxxx

作    者：CXQ
编写时间：2009.11
======================================== 修   改    历   史 =========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 =========================================
动作文件命名  ：动作名称_特点					特点如二板机、双色机等；或针对某厂家特殊机型。
												如未标示，则默认HT、常规三板机。
动作函数命名  ：Act_动作名称_模式_特点_序号		模式指手动(MM)、调模(AM)、自动(AU)、多种(MU或无)
												特点如某机型、某厂家的特有机型等
												序号用A、B、C……
动作函数ID命名：mASID_函数名_段名				

****************************************************************************************************/
#ifndef AL_SafeGate_h
	#define AL_SafeGate_h

#ifdef AL_SafeGate_c
	#define AL_SafeGate_ext
#else
	#define AL_SafeGate_ext extern
#endif


//动作组、细分、函数ID-----------------------------------------------------------------------------//
//在ActConf.h统一定义

//段ID定义(必须按序定义、要用于大小比较)-----------------------------------------------------------//
//动作函数-----------------------------------------------------------------------------------------//
void AL_SafeGateCls(void *FP,FActAttrStr *FAAP);
	#define mASID_AL_SafeGateCls_SGC		10	//安全门			调用安全门关

void AL_SafeGateOpenCls(void *FP,FActAttrStr *FAAP);
	#define mASID_AL_SafeGateOpenCls_SGOC	10	//开关安全门			调用安全门开关
	#define mASID_AL_SafeGateOpenCls_SGRC	20	//重新关安全门			安全继电器、循环启动异常时调用
	#define mASID_AL_SafeGateOpenCls_SRRC	30	//安全继电器复位检查	GB22530-HT逻辑
	#define mASID_AL_SafeGateOpenCls_CSKP	40	//循环启动键		

void SafeGate_Pcs(void);		//安全门处理			主要是进行后安全门监控
Bool MotOnSGBackChk(void);		//开马达后安全门检查


ActConf_ext Bool SafeGateOpenClsReClsFlag;		//安全门开关重新关标志	用于开关安全门动作，循环启动异常、安全回路异常时，重新关安全门

#endif

