/* Copyright (C) 2009 *******************************************************************************
									 杭州科强智能控制系统有限公司
=====================================================================================================
项目名称：T6F5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 =========================================
文件名称：xxxxxx
文件说明：xxxxxx

作    者：CXQ
编写时间：2009.11
======================================== 修   改    历   史 =========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 =========================================



****************************************************************************************************/
#ifndef AU_SteamInj_h
	#define AU_SteamInj_h

#ifdef AU_SteamInj_c
	#define AU_SteamInj_ext
#else
	#define AU_SteamInj_ext extern
#endif

//段ID定义(必须按序定义、要用于大小比较)-----------------------------------------------------------//

void AU_SteamInj(void *FP,FActAttrStr *FAAP);	//等待蒸汽设备信号
	#define mASID_AU_SteamInj_WaitEMO		10			//等待蒸汽设备信号:允许开模
	#define mASID_AU_SteamInj_WaitEInj		20			//等待蒸汽设备信号:允许注射

#endif

