/* Copyright (C) 2009 *******************************************************************************
									 杭州科强智能控制系统有限公司
=====================================================================================================
项目名称：T6F5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 =========================================
文件名称：xxxxxx
文件说明：xxxxxx

作    者：CXQ
编写时间：2009.11
======================================== 修   改    历   史 =========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 =========================================



****************************************************************************************************/
#ifndef DateTime_h
	#define DateTime_h

#ifdef DateTime_c
	#define DateTime_ext
#else
	#define DateTime_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/

/*======================================== 全局有效变量定义 =======================================*/
typedef struct{
	U8 Year;
	U8 Month;
	U8 Day;

	U8 Hour;
	U8 Minute;
	U8 Second;
}DateTimeStr;

/*======================================== 全局有效函数声明 =======================================*/
void DateTime_Init(void);					//日期时间初始化		
void DateTime_Pcs(void);					//日期时间处理			于主循环

DateTimeStr GetSysDateTime(void);			//获取系统日期时间		是以日历形式的绝对时间，暂只精确到小时
U32 GetSysDateTimeUnitS(void);				//获取系统日期时间		以S的形式
S32 SysDateTime_CalDisTime(DateTimeStr DT);	//检查间隔时间			（系统时间－比较时间），返回单位秒，暂只精确到小时


//注：界面以1小时为单位，更新日期时间，所以只精确到小时

#endif

