/* Copyright (C) 2019 *****************************************************************************
									 杭州科强智能控制系统有限公司
====================================================================================================
项目名称：T6H5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 ========================================
文件名称：Fun.h
文件说明：部分基础函数。

作    者：BSH
编写时间：2019.9
======================================== 修   改    历   史 ========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 ========================================


****************************************************************************************************/
#ifndef Fun_h
	#define Fun_h


#ifdef Fun_c
	#define Fun_ext 
#else
	#define Fun_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/
#define DisAllIrq()	__disable_irq()		//关闭全部中断使能
#define EnAllIrq()	__enable_irq()		//开启全部中断使能

typedef struct{
	float P; //估算协方差
    float G; //卡尔曼增益
    float Q; //过程噪声协方差,Q增大，动态响应变快，收敛稳定性变坏
    float R; //测量噪声协方差,R增大，动态响应变慢，收敛稳定性变好
    float Output; //卡尔曼滤波器输出
}KalmanFilter;

/*======================================== 全局有效变量定义 =======================================*/

/*======================================== 全局有效函数声明 =======================================*/
void CRC_CCITT_init(void);
U16 Cal_CRC(U8 ,U16 );					//CRC计算函数
U16 U16Array_Cal_CRC(U16 *AP,U16 Len);	//U16数组CRC计算函数
U16 U16Array_Cal_Sum(U16 *AP,U16 Len);	//U16数组累加和计算函数
U32 U32Array_Cal_Sum(U32 *AP,U32 Len);	//U32数组累加和计算函数
U16 Modbus_CRC16(U8 *AP,U8 Len);

#endif
