/* Copyright (C) 2009 *******************************************************************************
									 杭州科强智能控制系统有限公司
=====================================================================================================
项目名称：T6F5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 =========================================
文件名称：xxxxxx
文件说明：xxxxxx

作    者：CXQ
编写时间：2009.11
======================================== 修   改    历   史 =========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 =========================================



****************************************************************************************************/
#ifndef HAI_h
	#define HAI_h

#ifdef HAI_c
	#define HAI_ext
#else
	#define HAI_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/

/*======================================== 全局有效变量定义 =======================================*/
HAI_ext	U16 ReadSDRealPres;		//驱动器读取实时压力	需要一定实时性用于锁模力自动调整 
HAI_ext	U16 ReadSDRealFlow;		//驱动器读取实时流量	需要一定实时性用于锁模力自动调整 
HAI_ext	U16 ReadSDLinkRealPres;	//驱动器读取实时压力	
HAI_ext	U16 ReadSDLinkRealFlow;	//驱动器读取实时流量
HAI_ext	U8 MCHPPresHoldState;	//锁模力纠偏触发状态	20240523
	#define mMCHPPresHoldOff		0	//锁模力纠偏结束
	#define mMCHPPresHoldMoldThin	1	//锁模力纠偏调模进
	#define mMCHPPresHoldMoldThick	2	//锁模力纠偏调模退
HAI_ext	U32  MCHPPresSuprPres;	//锁模力纠偏憋压压力

/*======================================== 全局有效函数声明 =======================================*/
void HAI_Init(void);					//位置初始化		
void HAI_Pcs(void);						//位置处理					于主循环


#endif

