/* Copyright (C) 2019 *****************************************************************************
									 杭州科强智能控制系统有限公司
====================================================================================================
项目名称：T6H5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 ========================================
文件名称：main.h
文件说明：主文件

作    者：LC
编写时间：2019.9
======================================== 修   改    历   史 ========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 ========================================


****************************************************************************************************/
#ifndef Main_h
	#define Main_h

#ifdef Main_c
	#define Main_ext 
#else
	#define Main_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/
#define mSystemFre (200000000)	//系统主频   必须是晶振的整数倍

#define RunTimeMeasStart()	G10nsTimerRes(&RunTimer)			//执行时间测量开始
#define GetRunTime()		RunTime=G10nsTimerCal(&RunTimer)*10	//获取执行时间		单位1ns

/*======================================== 全局有效变量定义 =======================================*/
Main_ext U32 CycTime_Max,CycTime_Min,CycTime_Average;	//循环时间		单位1us
Main_ext U32 CycCnt,CycBuff;							//循环计数
Main_ext G10usTimer	AverageTimer;						//平均时间用计时器

Main_ext U32 RunTime;									//执行时间
Main_ext G10nsTimer RunTimer;							//执行时间计时器	单位10ns

Main_ext U32 SysBuff;
Main_ext G10usTimer SysTimer;


/*======================================== 全局有效函数声明 =======================================*/



#endif


