/* Copyright (C) 2009 *******************************************************************************
									 杭州科强智能控制系统有限公司
=====================================================================================================
项目名称：T6F5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 =========================================
文件名称：SysDef.h
文件说明：

作    者：CXQ
编写时间：2009.11
======================================== 修   改    历   史 =========================================
修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 =========================================
**名词定义、概述**
**与界面关系**

**使用方法**

**修改方法**

**注意事项**

默认单位：时间0.1s	位置0.1mm	压力1bar		流量1%	计数1clk		电流1mA		电压1mV		温度1c
****************************************************************************************************/
#ifndef SysDef_h 
	#define SysDef_h

/*========================================= 全局有效宏定义 ========================================*/


/*======================================== 全局有效变量定义 =======================================*/


/*======================================== 全局有效函数声明 =======================================*/
#define mProgDebug				//程序调试			程序要发行时，需注释掉该行		??? 

#define mT6H5_Basic				//项目：T6H5的基础程序

#define mProg_CM				//主机程序

#define mCMSoftSer     	8100	//主机软件系列
#define mCMSoftVer     	265	//主机软件版本

#define	mCMSoftLinkCode				12189//主机程序互连代码
#define mCMSoftHardConfLinkCode		10	//主机程序、硬件配置互连代码	范围0-99		原则上不更改，否则会导致用户原先保存的资料因程序升级而无法使用
#define mCMSoftMachParaLinkCode		10	//主机程序、机器参数互连代码	范围0-99		原则上不更改，否则会导致用户原先保存的资料因程序升级而无法使用
#define mCMSoftManuParaLinkCode		10	//主机程序、生产参数互连代码	范围0-99		原则上不更改，否则会导致用户原先保存的资料因程序升级而无法使用
#define mCMSoftSysParaLinkCode		10	//主机程序、系统参数互连代码	范围0-99		原则上不更改，否则会导致用户原先保存的资料因程序升级而无法使用

/*???界面通过CAN读取上述各“程序与参数互连代码”，以便现场调试检查*/

#define mSysFlowMax		9999		//系统流量最大值 20191021改：放大100倍

//中断优先级分配：
//	1、最高的必须为网口中断，因为在PDO定时中断里还会发生网口接收数中断，需要嵌套。
//	2、第二高优先级为PDO发送定时中断，为了得到一个较快的数据处理响应
//	3、其他中断都为最低优先级（PDO发送定时中断也可以是这个优先级）
#define mIRQGroup		0		//中断优先组	0-0位抢占，4位子优先级；1-1位抢占，3位子优先级；……4-4位抢占，0位子优先级；
#define mIRQPriorityH	0		//最高优先级
#define mIRQPriorityM	0		//中间优先级
#define mIRQPriorityL	0		//最低优先级


#endif

