/* Copyright (C) 2009 *******************************************************************************
									 杭州科强智能控制系统有限公司
=====================================================================================================
项目名称：T6F5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 =========================================
文件名称：xxxxxx
文件说明：xxxxxx

作    者：CXQ
编写时间：2009.11
======================================== 修   改    历   史 =========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 =========================================



****************************************************************************************************/
#ifndef Temp_h
	#define Temp_h

#ifdef Temp_c
	#define Temp_ext
#else
	#define Temp_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/
#define mTemp_PwrOff_001C		777777	//断电  		单位0.001c
#define mTemp_TherBrk_001C		888888	//断偶  		单位0.001c
#define mTemp_OverRange_001C	999999	//超量程		单位0.001c


/*======================================== 全局有效变量定义 =======================================*/


/*======================================== 全局有效函数声明 =======================================*/
void Temp_Init(void);		//温度初始化
void Temp_Pcs(void);		//温度处理			于主循环


void ZoneHtrOff(void);				//关料筒加热器
void ZoneHtrOn(void);				//开料筒加热器
Bool ZoneHtrIsOn(void);				//料筒加热器开着检查
Bool ZoneHtrKeepIsWarm(void);		//料筒加热器保温状态检查

Bool ScrewActZoneTempChk(void);		//螺杆动作时料管温度检查
Bool ScrewActCoolProtChk(void);		//螺杆动作时料管防冷启动检查

Bool MotOnOilTempChk(void);			//开电机时油温检查
Bool MotOnMotTempChk(void);			//开电机时电机温度检查
Bool MotOnMot2TempChk(void);		//开电机时电机温度检查							20190311加

U32 GetOilTemp(void);				//获取油温			主要由油温加热函数使用
U32 GetMotorTemp(void);				//获取马达温度		主要由AL_MotDrv中使用
U32 GetMotor2Temp(void);			//获取马达温度		主要由AL_MotDrv中使用		20190311加

void TCPIDClrUi(void);				//20190410	积分量在电热开时清0

#endif

