/* Copyright (C) 2009 *******************************************************************************
									 杭州科强智能控制系统有限公司
=====================================================================================================
项目名称：T6F5型注塑机控制器
项目简介：新一代注塑机控制器的软、硬件平台。软件方面要达到易扩展、易维护之目的。

======================================== 文   件    信   息 =========================================
文件名称：xxxxxx
文件说明：xxxxxx

作    者：WLZ
编写时间：2017.11
======================================== 修   改    历   史 =========================================
修 改 人：
修改日期：
修改说明：

修 改 人：
修改日期：
修改说明：
======================================== 其   它    说   明 =========================================



****************************************************************************************************/
#ifndef Wave_485_h
	#define Wave_485_h

#ifdef Wave_485_c
	#define Wave_485_ext
#else
	#define Wave_485_ext extern
#endif
/*========================================= 全局有效宏定义 ========================================*/

//触发模式定义如下：
	#define mW485_Off				0	//关闭
	#define mW485_Con				1	//连续
	#define mW485_Cyc				2	//循环
	#define mW485_MoldOpen			10	//开模
	#define mW485_MoldCls			11	//关模
	#define mW485_Inject			20	//注射
	#define mW485_Charge			21	//储料
	#define mW485_SuckBack			22	//射退
	#define mW485_Eject				30	//托模
	#define mW485_MoldAct			60	//模板动作		包括开、关模
	#define mW485_ScrewAct			61	//螺杆动作		包括注射、储料、射退
	#define mW485_EjectAct			62	//顶针动作		包括托进、托退
              	
//波形类型功能定义如下：
	#define mW485_RealMoldPos		0	//实时模板位置
	#define mW485_RealScrewPos		1	//实时螺杆位置
	#define mW485_RealEjectPos		2	//实时顶针位置
	#define mW485_RealNozPos		3	//实时座台位置
	#define mW485_RealHAI1			4	//实时模拟量一
	#define mW485_RealHAI2			5	//实时模拟量二
	#define mW485_RealHAI3			6	//实时模拟量三
	#define mW485_SDRealPres		7	//驱动器实时压力			20141015加：适应多个蒙德驱动器波形显示
	#define mW485_SDRealFlow		8	//驱动器实时流量			20141015加：适应多个蒙德驱动器波形显示
	#define mW485_MoldSpeed			9	//模板速度
	#define mW485_ScrewSpeed		10	//螺杆速度
	#define mW485_EjectSpeed		11	//顶针速度
	
/*======================================== 全局有效变量定义 =======================================*/


/*======================================== 全局有效函数声明 =======================================*/
void Wave_485_Init(void);					//初始化		
void Wave_485_Pcs(void);					//处理					于主循环
U32 ReadPointBuff(U32 *WaveP);				//读取数
U8 GetTriMode(void);						//获取触发模式

#endif

